import React, { Component } from 'react';
import { Table } from '@alifd/next';

const dataSource = [
  {
    account: '1',
    title: '主营业务收入',
    sumary: 120000,
    '2019年1月': 10000,
    '2019年2月': 10000,
    '2019年3月': 10000,
    '2019年4月': 10000,
    '2019年5月': 10000,
    '2019年6月': 10000,
    '2019年7月': 10000,
    '2019年8月': 10000,
    '2019年9月': 10000,
    '2019年10月': 10000,
    '2019年11月': 10000,
    '2019年12月': 10000,
    children: [
      {
        account: '101',
        title: '仓库租金收入',
        sumary: 120000,
        '2019年1月': 10000,
        '2019年2月': 10000,
        '2019年3月': 10000,
        '2019年4月': 10000,
        '2019年5月': 10000,
        '2019年6月': 10000,
        '2019年7月': 10000,
        '2019年8月': 10000,
        '2019年9月': 10000,
        '2019年10月': 10000,
        '2019年11月': 10000,
        '2019年12月': 10000
      },
      {
        account: '102',
        title: '仓库装卸收入',
        sumary: 120000,
        '2019年1月': 10000,
        '2019年2月': 10000,
        '2019年3月': 10000,
        '2019年4月': 10000,
        '2019年5月': 10000,
        '2019年6月': 10000,
        '2019年7月': 10000,
        '2019年8月': 10000,
        '2019年9月': 10000,
        '2019年10月': 10000,
        '2019年11月': 10000,
        '2019年12月': 10000
      },
      {
        account: '103',
        title: '仓储服务收入',
        sumary: 120000,
        '2019年1月': 10000,
        '2019年2月': 10000,
        '2019年3月': 10000,
        '2019年4月': 10000,
        '2019年5月': 10000,
        '2019年6月': 10000,
        '2019年7月': 10000,
        '2019年8月': 10000,
        '2019年9月': 10000,
        '2019年10月': 10000,
        '2019年11月': 10000,
        '2019年12月': 10000
      },
      {
        account: '104',
        title: '运输收入',
        sumary: 120000,
        '2019年1月': 10000,
        '2019年2月': 10000,
        '2019年3月': 10000,
        '2019年4月': 10000,
        '2019年5月': 10000,
        '2019年6月': 10000,
        '2019年7月': 10000,
        '2019年8月': 10000,
        '2019年9月': 10000,
        '2019年10月': 10000,
        '2019年11月': 10000,
        '2019年12月': 10000
      },
      {
        account: '105',
        title: '管理费收入',
        sumary: 120000,
        '2019年1月': 10000,
        '2019年2月': 10000,
        '2019年3月': 10000,
        '2019年4月': 10000,
        '2019年5月': 10000,
        '2019年6月': 10000,
        '2019年7月': 10000,
        '2019年8月': 10000,
        '2019年9月': 10000,
        '2019年10月': 10000,
        '2019年11月': 10000,
        '2019年12月': 10000
      },
      {
        account: '106',
        title: '其它收入',
        sumary: 120000,
        '2019年1月': 10000,
        '2019年2月': 10000,
        '2019年3月': 10000,
        '2019年4月': 10000,
        '2019年5月': 10000,
        '2019年6月': 10000,
        '2019年7月': 10000,
        '2019年8月': 10000,
        '2019年9月': 10000,
        '2019年10月': 10000,
        '2019年11月': 10000,
        '2019年12月': 10000
      }
    ]
  }
];

class IncomeStatement extends Component {
  render() {
    return (
      <div>
        
        
      <Table dataSource={dataSource} primaryKey="account" fixedHeader isTree>
        <Table.Column title="项目" dataIndex="title" lock width={200} />
        <Table.Column title="合计" dataIndex="sumary" lock width={100}  />
        <Table.Column title="2019年1月" dataIndex="2019年1月" width={100}  />
        <Table.Column title="2019年2月" dataIndex="2019年2月" width={100}  />
        <Table.Column title="2019年3月" dataIndex="2019年3月" width={100}  />
        <Table.Column title="2019年4月" dataIndex="2019年4月" width={100}  />
        <Table.Column title="2019年5月" dataIndex="2019年5月" width={100}  />
        <Table.Column title="2019年6月" dataIndex="2019年6月" width={100}  />
        <Table.Column title="2019年7月" dataIndex="2019年7月" width={100}  />
        <Table.Column title="2019年8月" dataIndex="2019年8月" width={100}  />
        <Table.Column title="2019年9月" dataIndex="2019年9月" width={100}  />
        <Table.Column title="2019年10月" dataIndex="2019年10月" width={100}  />
        <Table.Column title="2019年11月" dataIndex="2019年11月" width={100}  />
        <Table.Column title="2019年12月" dataIndex="2019年12月" width={100}  />
      </Table>
      </div>
    );
  }
}

export default IncomeStatement;
